{"basics":{"name":"David Jr Sim","picture":"https://via.placeholder.com/240x240","email":"dsim@cs.ucsb.edu","website":"https://www.printhello.world","location":{"city":"Los Angeles","countryCode":"US","region":"California"},"profiles":[{"network":"Github","username":"dscpsyl","url":"https://github.com/dscpsyl"},{"network":"LinkedIn","username":"davidjsim","url":"https://www.linkedin.com/in/davidjsim/"}]},"work":[{"company":"Associated Students of the University of California Santa Barbara","position":"Special Interim Machine Learning Researcher","website":"https://www.ids.osaka-u.ac.jp/en/","startDate":"2024-06-01","endDate":"2024-08-01","highlights":["Utilized PyTorch, Trio3, and other modern software to develop a pipeline harnessing Unet, TeethSeg, and other medial machine learning networks.","Organized and participated with cross-departmental teams to design and implement novel AI architecture in the clinical setting.","Authored and co-authored a research paper detailing findings and results for publication in peer-reviewed journals and academic conferences.","Conducted extensive literature reviews and synthesized research findings to develop novel deep learning approaches to medical image analysis.","Contributed to a 40% increase in lab funding by driving key research advancements during tenure."]},{"company":"Isla Vista Tenants Union","position":"Technology Director","website":"https://ivtu.as.ucsb.edu/","startDate":"2022-09-01","endDate":"2023-09-01","highlights":["Constructed a personable chatbot for commonly asked questions using decision trees, reducing human intervention and casework load by 19%.","Upgraded scheduling software using logistic regression to auto-reschedule tenants in between open slots, improving casework efficiency by 40%.","Trained algorithms on classifying property management providers on ratemyivrental.com using sentimental analysis.","Organized Agile development team to improve feature development times by 30% through ad hoc committees.","Conformed the organization's website to WCAG 2 standards for better content delivery to student tenants and website visitors."]},{"company":"UCSB SexInfo Online","position":"Lead Webmaster","website":"https://sexinfoonline.com/","startDate":"2013-12-01","endDate":"2022-12-01","highlights":["Led a web development team to monitor and refactor the company's website while allowing for backward compatibility with existing APIs.","Calibrated website to satisfy university and WCAG 2 requirements.","Implemented Redis caching and CDNs to improve load times by 23%.","Formalized new member orientation to the codebase and simplified introduction period by 1 week.","Maintained the internal WordPress plugin, ensuring bug fixes and a 99.999% uptime."]}],"skills":[{"name":"AI & ML","keywords":["Python","PyTorch","OpenCV2"]},{"name":"Fullstack","keywords":["MySQL","PostgreSQL","MongoDB","React","Django","S3"]},{"name":"SysAdmin","keywords":["UNIX","Nginx","Bash","Docker","Cmdline"]},{"name":"Low Level","keywords":["C++","Rust"]},{"name":"Dev Tools","keywords":["Git","Agile"]}],"education":[{"institution":"University of California - Santa Barbara","area":"Computer Science (B.S.) | Psychology & Brain Science (B.S.) | Statistical Science Minor","studyType":"Bachelor of Science"}]}
